In [1]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("../../Data/data_2017_2021.csv")

In [5]:
df.head()

,LastName,FirstName,Gender,Country,Date,Competition,Round,Location,Apparatus,Rank,D_Score,E_Score,Penalty,Score
0,ABDUL,HADI,w,MAS,SUN 25 JUL 2021,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566
1,ABDUL,HADI,w,MAS,SUN 25 JUL 2021,Olympic Games,qual,"Tokyo, Japan",FX,64.0,4.6,7.633,NaN,12.233
2,ABDUL,HADI,w,MAS,SUN 25 JUL 2021,Olympic Games,qual,"Tokyo, Japan",UE,74.0,5.1,6.500,NaN,11.600
3,ABDUL,HADI,w,MAS,SUN 25 JUL 2021,Olympic Games,qual,"Tokyo, Japan",VT,72.0,4.6,8.566,NaN,13.166
4,ABDUL HADI,Farah Ann,w,MAS,25 July 2021,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566

In [6]:
df["Gender"].value_counts()

Gender
w    765
Name: count, dtype: int64

In [7]:
df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_98273/579959469.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Date'] = pd.to_datetime(df['Date'], errors='coerce')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   LastName     765 non-null    object
 1   FirstName    765 non-null    object
 2   Gender       765 non-null    object
 3   Country      765 non-null    object
 4   Date         765 non-null    datetime64[ns]
 5   Competition  765 non-null    object
 6   Round        765 non-null    object
 7   Location     765 non-null    object
 8   Apparatus    765 non-null    object
 9   Rank         761 non-null    float64
 10  D_Score      761 non-null    float64
 11  E_Score      761 non-null    float64
 12  Penalty      90 non-null     float64
 13  Score        758 non-null    float64
dtypes: datetime64[ns](1), float64(5), object(8)
memory usage: 83.8+ KB

In [9]:
df.head()

,LastName,FirstName,Gender,Country,Date,Competition,Round,Location,Apparatus,Rank,D_Score,E_Score,Penalty,Score
0,ABDUL,HADI,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566
1,ABDUL,HADI,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",FX,64.0,4.6,7.633,NaN,12.233
2,ABDUL,HADI,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",UE,74.0,5.1,6.500,NaN,11.600
3,ABDUL,HADI,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",VT,72.0,4.6,8.566,NaN,13.166
4,ABDUL HADI,Farah Ann,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566

In [10]:
df["Apparatus"].value_counts()

Apparatus
BB     204
UE     203
FX     200
VT     104
VT1     27
VT2     27
Name: count, dtype: int64

In [11]:
# # Define the values to be replaced and their replacements
# replace_dict = {'VT1': 'VT', 'VT2': 'VT'}

# # Use .replace() with the defined dictionary
# df['Apparatus'] = df['Apparatus'].replace(replace_dict)

In [12]:
df["Apparatus"].value_counts()

Apparatus
BB     204
UE     203
FX     200
VT     104
VT1     27
VT2     27
Name: count, dtype: int64

In [13]:
df["FirstName"].nunique()

101

In [14]:
df["LastName"].nunique()

101

In [15]:
df["FirstName"].isnull().sum()

0

In [16]:
df["LastName"].isnull().sum()

0

In [17]:
df["Name"] = df["FirstName"] + ' ' + df['LastName']

In [18]:
df = df.drop(columns=["FirstName", "LastName"])

In [19]:
df["Competition"].value_counts()

Competition
Olympic Games    765
Name: count, dtype: int64

In [20]:
df["Round"].value_counts()

Round
qual     629
final    136
Name: count, dtype: int64

In [15]:
df["Location"].value_counts()

Location
Tokyo, Japan    765
Name: count, dtype: int64

In [16]:
df.head()

,Gender,Country,Date,Competition,Round,Location,Apparatus,Rank,D_Score,E_Score,Penalty,Score,Name
0,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566,HADI ABDUL
1,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",FX,64.0,4.6,7.633,NaN,12.233,HADI ABDUL
2,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",UE,74.0,5.1,6.500,NaN,11.600,HADI ABDUL
3,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",VT,72.0,4.6,8.566,NaN,13.166,HADI ABDUL
4,w,MAS,2021-07-25,Olympic Games,qual,"Tokyo, Japan",BB,76.0,4.8,6.766,NaN,11.566,Farah Ann ABDUL HADI

In [17]:
df["Date"].value_counts()

Date
2021-07-25    629
2021-07-29     96
2021-08-01     40
Name: count, dtype: int64

In [18]:
df = df.drop(columns=["Competition", "Location"])

In [19]:
df = df.drop(columns=["Gender"])

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    765 non-null    object
 1   Date       765 non-null    datetime64[ns]
 2   Round      765 non-null    object
 3   Apparatus  765 non-null    object
 4   Rank       761 non-null    float64
 5   D_Score    761 non-null    float64
 6   E_Score    761 non-null    float64
 7   Penalty    90 non-null     float64
 8   Score      758 non-null    float64
 9   Name       765 non-null    object
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 59.9+ KB

In [21]:
df.columns

Index(['Country', 'Date', 'Round', 'Apparatus', 'Rank', 'D_Score', 'E_Score',
       'Penalty', 'Score', 'Name'],
      dtype='object')

In [22]:
df = df[['Name', 'Country', 'Date', 'Round', 'Apparatus', 'Rank', 'D_Score', 'E_Score',
       'Penalty', 'Score', ]]

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       765 non-null    object
 1   Country    765 non-null    object
 2   Date       765 non-null    datetime64[ns]
 3   Round      765 non-null    object
 4   Apparatus  765 non-null    object
 5   Rank       761 non-null    float64
 6   D_Score    761 non-null    float64
 7   E_Score    761 non-null    float64
 8   Penalty    90 non-null     float64
 9   Score      758 non-null    float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 59.9+ KB

In [24]:
df['Penalty'].fillna(0, inplace=True)

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 765 entries, 0 to 764
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       765 non-null    object
 1   Country    765 non-null    object
 2   Date       765 non-null    datetime64[ns]
 3   Round      765 non-null    object
 4   Apparatus  765 non-null    object
 5   Rank       761 non-null    float64
 6   D_Score    761 non-null    float64
 7   E_Score    761 non-null    float64
 8   Penalty    765 non-null    float64
 9   Score      758 non-null    float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 59.9+ KB

In [26]:
df.dropna(inplace=True)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 758 entries, 0 to 764
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       758 non-null    object
 1   Country    758 non-null    object
 2   Date       758 non-null    datetime64[ns]
 3   Round      758 non-null    object
 4   Apparatus  758 non-null    object
 5   Rank       758 non-null    float64
 6   D_Score    758 non-null    float64
 7   E_Score    758 non-null    float64
 8   Penalty    758 non-null    float64
 9   Score      758 non-null    float64
dtypes: datetime64[ns](1), float64(5), object(4)
memory usage: 65.1+ KB

In [28]:
# df.to_csv('cleaned17to21.csv', index=False)